ERP DEV.WMS/src/Documents/вмс_ПередачаНаХранение/вмс_ПередачаНаХранение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ПередачаНаХранение</name>
  <registerRecords>AccumulationRegister.вмс_ОстаткиТоваровПоклажедателя</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.вмс_СписокСтатусовДокументовПоклажедателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.вмс_Поклажедатели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВнешнегоФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеСопоставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДляЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДляЗаполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПоклажедателя</name>
      <type>
        <types>CatalogRef.вмс_КарточкаПоклажедателя</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОстаткиТоваровПоклажедателя/вмс_ОстаткиТоваровПоклажедателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОстаткиТоваровПоклажедателя</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.вмс_КарточкаПоклажедателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/Enums/вмс_СписокСтатусовДокументовПоклажедателей/вмс_СписокСтатусовДокументовПоклажедателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_СписокСтатусовДокументовПоклажедателей</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПоставки</name>
  </enumValues>
  <enumValues>
    <name>ПринятНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>ОтбылСоСклада</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>ПереданНаСборку</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетЗаписи</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетЗаполнения</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаЗаполненияИзФайла</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Documents/вмс_ПередачаНаХранение/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
		
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПолноеСопоставление = Ложь Тогда
		ПроверкаСопоставления = ПроверитьСопоставлениеСУчетнойСистемой();
		
		Если ПроверкаСопоставления Тогда
			ПолноеСопоставление = Истина;
			Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ОжидаетПоставки;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.Отклонен Тогда
		НайденныйДок = вмс_ЛичныйКабинетПоклажедателяВызовСервер.НайтиДокументУчетнойСистемы(ЭтотОбъект.Ссылка);
		
		Если НайденныйДок <> Неопределено Тогда
			НайденныйДок.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);	
		КонецЕсли;
		
		ЭтотОбъект.УстановитьПометкуУдаления(Истина); 
		
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПередатьСтатусДокумента(ЭтотОбъект.Ссылка, "ПередачаНаХранение");
	ИначеЕсли Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ПринятНаСкладе Тогда
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ОтправитьДокПередачаНаХранение(ЭтотОбъект.Ссылка);
	Иначе
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПередатьСтатусДокумента(ЭтотОбъект.Ссылка, "ПередачаНаХранение");
	КонецЕсли;
	
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, Режим)	
	
	Если Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ПринятНаСкладе Тогда
		
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Истина;
		Движения.вмс_ОстаткиТоваровПоклажедателя.Очистить();    
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записать(); 
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Истина;
		
		Для Каждого ТекСтрокаСписокНоменклатуры Из Товары Цикл
			Движение = Движения.вмс_ОстаткиТоваровПоклажедателя.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.НоменклатураПоклажедателя;
			Движение.Количество = ТекСтрокаСписокНоменклатуры.КоличествоФакт; 
			Движение.Контрагент = Контрагент;
			Движение.Склад = Склад;
		КонецЦикла;
		
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСопоставлениеСУчетнойСистемой()
	
	Проверка = Истина;
	
	Для каждого СтрокаТЧ Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Номенклатура) Тогда
			Проверка = Ложь;
		Иначе
			СтрокаТЧ.Номенклатура = СтрокаТЧ.НоменклатураПоклажедателя.Номенклатура;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Упаковка) Тогда
			Проверка = Ложь;
		Иначе
			СтрокаТЧ.Упаковка = СтрокаТЧ.НоменклатураПоклажедателя.Упаковка;
		КонецЕсли;
		
		Если вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверкаИспользованияХарактеристикПоКонтрагенту(Контрагент) Тогда
			Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.НоменклатураПоклажедателя, "БезХарактеристики") Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Характеристика) Тогда
					Проверка = Ложь;
				Иначе
					СтрокаТЧ.Характеристика = СтрокаТЧ.НоменклатураПоклажедателя.Характеристика;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Проверка;
	
КонецФункции


#Иначе
#КонецЕсли
